
Задание. Написать программу вычисления стоимости покупки с учетом скидки.
Скидка в 3% предоставляется в том случае, если сумма покупки больше 500 руб.

using System;

private static void Main()
{
	int a;
	int b;
	a = int.Parse(ConsoleInput.ReadToWhiteSpace(true));
	if (a >= 500)
	{
	   b = (int)a - (a * (3.0 / 100));
	   Console.Write(b);
	}

}